ERM/src/DataProcessors/BillingSpecialistDesktop.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>BillingSpecialistDesktop</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ERM/src/InformationRegisters/SalesOrdersComments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SalesOrdersComments</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Reason</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SalesOrderStatus</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Billed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExpectedDateForInvoice</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EscalateTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/SalesOrderBilledStatus/SalesOrderBilledStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SalesOrderBilledStatus</name>
  <enumValues>
    <name>Unbilled</name>
  </enumValues>
  <enumValues>
    <name>Billed</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
</mdclass:Enum>

ERM/src/DataProcessors/BillingSpecialistDesktop/Forms/ФормаСтатусаSalesOrder/Ext/Form/Module.bsl
//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	СтруктураРеквизитовПроблемы = Новый Структура("Дата, SalesOrder, User, Reason, Billed, ExpectedDateForInvoice, EscalateTo, Details, Responsibles");
//	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовПроблемы, ЭтотОбъект);
//	СтруктураРеквизитовПроблемы.Дата = ТекущийОбъект.Период;
//	СтруктураРеквизитовПроблемы.SalesOrder = ТекущийОбъект.SalesOrder;
//	
//	Если ЗначениеЗаполнено(ТекущийОбъект.Problem) Тогда
//		РегистрыСведений.SalesOrdersComments.ПерезаполнитьРеквизитыSalesOrderProblem(ТекущийОбъект.Problem, СтруктураРеквизитовПроблемы);
//	Иначе
//		ТекущийОбъект.Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = РГСофт.ПолучитьДатуСервера();
	Если Не ЗначениеЗаполнено(User) Тогда
		User = Пользователи.ТекущийПользователь();
	КонецЕсли;

	СписокSalesOrders = Параметры.СписокSalesOrders;
	ДоступностьBilled = Истина;
	Для Индекс = 0 По СписокSalesOrders.Количество() - 1 Цикл
		Если СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.Lawson ИЛИ СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ
			СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.OracleSmith ИЛИ СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.HOBs И СписокSalesOrders[Индекс].Значение.Company = Справочники.Организации.НайтиПоКоду("385") Тогда
			ДоступностьBilled = Ложь;
		КонецЕсли;
	КонецЦикла;
	Элементы.Billed.Доступность = ДоступностьBilled;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура SaveНаСервере(СообщениеОбОшибке)
	
	НЗ = РегистрыСведений.SalesOrdersComments.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	
	СтатусBilledИзКомментария = Ложь;
	Если Billed = Перечисления.SalesOrderBilledStatus.ПустаяСсылка() Тогда
		СтатусBilledИзКомментария = Истина;
		//Запрос
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	SalesOrdersCommentsСрезПоследних.Problem.Billed КАК Billed,
			|	SalesOrdersCommentsСрезПоследних.SalesOrder
			|ИЗ
			|	РегистрСведений.SalesOrdersComments.СрезПоследних(, SalesOrder В (&СписокSalesOrders)) КАК SalesOrdersCommentsСрезПоследних";
		
		Запрос.УстановитьПараметр("СписокSalesOrders", СписокSalesOrders);
		
		НачатьТранзакцию();
		КэшBilled = Запрос.Выполнить().Выгрузить();
		КэшBilled.Индексы.Добавить("SalesOrder");
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Для каждого ЭлементСписка Из СписокSalesOrders Цикл
		
		СтруктураРеквизитовПроблемы = Новый Структура("Дата, SalesOrder, User, Reason, Billed, ExpectedDateForInvoice, EscalateTo, Details, Responsibles");
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовПроблемы, ЭтотОбъект);
		
		СтруктураРеквизитовПроблемы.Дата = Период;
		СтруктураРеквизитовПроблемы.SalesOrder = ЭлементСписка.Значение;
		
		Если СтатусBilledИзКомментария Тогда
			НайденныйSalesOrder = КэшBilled.Найти(ЭлементСписка.Значение, "SalesOrder");
			Если НайденныйSalesOrder = Неопределено Тогда
				СообщениеОбОшибке = "For the selected Sales Order is not status";
				Прервать;
			Иначе
			СтруктураРеквизитовПроблемы.Billed = НайденныйSalesOrder.Billed;
			КонецЕсли;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);

		НЗ.Очистить();
		НЗ.Отбор.SalesOrder.Установить(ЭлементСписка.Значение);

		Запись = НЗ.Добавить();
		Запись.Период = Период;
		Запись.SalesOrder = ЭлементСписка.Значение;
		Запись.Problem = Problem;
		НЗ.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Save(Команда)
	СообщениеОбОшибке = "";
	SaveНаСервере(СообщениеОбОшибке);
	Закрыть();
	Если СообщениеОбОшибке <> "" Тогда
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ResponsiblesПриИзменении(Элемент)
КонецПроцедуры
